Autodesk.Revit.DB.PropertySetupType
Since:
2026
An enumerated type listing the types of property sets stored in the template.
Since:
2026

Autodesk.Revit.DB.PropertySetupType.UserDefinedPropertySets
The user-defined property sets.

Autodesk.Revit.DB.PropertySetupType.RevitSchedules
The Revit schedules.

Autodesk.Revit.DB.PropertySetupType.RevitMaterialParameters
The Revit material parameters.

Autodesk.Revit.DB.PropertySetupType.IfcBaseQuantities
The base quantities.

Autodesk.Revit.DB.PropertySetupType.RevitElementParameters
The Revit element parameters.

Autodesk.Revit.DB.PropertySetupType.IfcCommonPropertySets
The IFC common property sets.